app/views/jobs/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  <strong>Author:</strong>
  <%= User.find(@job.author_id).username %>