app/controllers/main_controller.rb

  def index
    if check_if_authorized
      redirect_to User.find_by_id(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]