app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Cepe6"], ["LIMIT", 1]]
---
  def create
    @header_picture = 'account.png'

    user = User.find_by(username: params[:username])