app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    set_profile
    @users = User.all

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Cepe6"], ["email", "cepe6"], ["password_digest", "what?"], ["created_at", 2017-05-11 23:36:44 UTC], ["updated_at", 2017-05-11 23:36:44 UTC]]
---
  def create
    set_default
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "country" = ?, "position" = ?, "gender" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["country", "Bulgaria"], ["position", "Newbie"], ["gender", "Male"], ["updated_at", 2017-05-13 06:58:23 UTC], ["id", 5]]
---
  def update
    set_profile
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    set_profile
    @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_profile
      @user = User.find_by(id: session[:user_id])